# Pandas
- high performance & familiar data structure & data analysis tools

In [2]:
import pandas as pd

# Panda series
- one dimensional array of object
- each row has an index
- by default index is zero-based

In [9]:
# how to create a new series using panda
airports = pd.Series(["Soekarno-Hatta", "Sabiha-Gokcen", "SSQ 2", "Adi-Sutjipto", "Narita"])
airports

0    Soekarno-Hatta
1     Sabiha-Gokcen
2             SSQ 2
3      Adi-Sutjipto
4            Narita
dtype: object

In [6]:
# use loop to iterate airports value
for airport in airports:
    print(airport)

Soekarno-Hatta
Sabiha-Gokcen
SSQ 2
Adi-Sutjipto
Narita

# Data Frame
- for 2 dimensional data structures
- similar to a table in database

In [8]:
# how to create new dataframe using panda
airports = pd.DataFrame([
    ["Soekarno-Hatta", "Jakarta", "Indonesia"],
    ["Sabiha-Gokcen", "Istanbul", "Turki"],
    ["SSQ 2", "Pekanbaru", "Indonesia"],
    ["Adi-Sutjipto", "Yogyakarta", "Indonesia"],
    ["Harita", "Tokyo", "Japan"]
])
airports

                0           1          2
0  Soekarno-Hatta     Jakarta  Indonesia
1   Sabiha-Gokcen    Istanbul      Turki
2           SSQ 2   Pekanbaru  Indonesia
3    Adi-Sutjipto  Yogyakarta  Indonesia
4          Harita       Tokyo      Japan

In [10]:
# how to label the column
airports = pd.DataFrame([
    ["Soekarno-Hatta", "Jakarta", "Indonesia"],
    ["Sabiha-Gokcen", "Istanbul", "Turki"],
    ["SSQ 2", "Pekanbaru", "Indonesia"],
    ["Adi-Sutjipto", "Yogyakarta", "Indonesia"],
    ["Harita", "Tokyo", "Japan"]],
    columns=["Name", "City", "Country"]
)
airports

             Name        City    Country
0  Soekarno-Hatta     Jakarta  Indonesia
1   Sabiha-Gokcen    Istanbul      Turki
2           SSQ 2   Pekanbaru  Indonesia
3    Adi-Sutjipto  Yogyakarta  Indonesia
4          Harita       Tokyo      Japan